{
  "backend/main.mo": "Motoko canister managing user profiles, networks, transmissions, and authorization with persistent state and access‑controlled queries and updates.",
  "feature_evidence.json": "Feature evidence report mapping UI background and layout requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of all major frontend React components, pages, and hooks.",
  "frontend/index.css": "Tailwind CSS base setup defining light/dark theme tokens and applying global background and text styles.",
  "frontend/index.html": "HTML entry point setting up root div and loading the main frontend script.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, auth gating, and profile initialization flow.",
  "frontend/src/components/AppLayout.tsx": "Shared layout with header, footer, navigation, and consistent dark background wrapper.",
  "frontend/src/components/AudioLevelMeter.tsx": "Component rendering a segmented audio input level meter driven by audio metering hook.",
  "frontend/src/components/AuthGate.tsx": "Guard component blocking access to protected routes and prompting login when unauthenticated.",
  "frontend/src/components/ColorAccentPanel.tsx": "Neutral dark‑theme panel wrapper providing subtle bordered container without bright accents.",
  "frontend/src/components/ColorPageHeader.tsx": "Renders a themed page header with optional icon, title, and subtitle. Provides a neutral styled container used across various page variants.",
  "frontend/src/components/DirectoryBrowser.tsx": "Displays a searchable, filterable list of digital networks and their talkgroups with favorite toggling. Handles network and talkgroup selection logic.",
  "frontend/src/components/IaxDvswitchConnectForm.tsx": "Form for configuring and saving IAX/DVSwitch gateway connection settings. Validates input and redirects to the PTT page after saving.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity with status handling. Clears cached data on logout and retries if the user is already authenticated.",
  "frontend/src/components/NowHearingList.tsx": "Shows a live list of recent transmissions with metadata and timestamps. Handles loading, empty state, and active transmission display.",
  "frontend/src/components/PersonalDirectoryEntries.tsx": "Manages user-defined directory entries stored in localStorage, with add and delete functionality. Renders entry cards and an input form for new entries.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog for initial user profile setup requiring callsign and license acknowledgement. Saves the profile and handles validation and errors.",
  "frontend/src/components/PttControl.tsx": "Push-to-talk button managing press/hold interactions and transmit state. Calls start/stop callbacks and updates visual feedback accordingly.",
  "frontend/src/components/RealTimeStatusBadge.tsx": "Displays connection, transmit, and receive status badges along with the room label.",
  "frontend/src/components/TransmitDisclaimer.tsx": "Shows a warning alert requiring users to acknowledge a valid amateur radio license before using voice features.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useAudioLevelMeter.ts": "Tracks microphone audio levels in real time using Web Audio API and reports activity state.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches and updates the caller's user profile through backend actor queries and mutations.",
  "frontend/src/hooks/useFavorites.ts": "Loads and toggles a user's favorite networks via backend actor calls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, and identity persistence.",
  "frontend/src/hooks/useMicPttRecorder.ts": "Handles push‑to‑talk audio recording using MediaRecorder and returns the recorded audio URL.",
  "frontend/src/hooks/useNetworks.ts": "Retrieves builtin networks and performs client‑side search filtering via backend actor.",
  "frontend/src/hooks/useNowHearing.ts": "Fetches real‑time 'now hearing' transmissions with polling and allows manual updates.",
  "frontend/src/hooks/usePreferredConnection.ts": "Stores, loads, and manages preferred connection settings with backward compatibility support.",
  "frontend/src/hooks/useQrzLookup.ts": "Performs QRZ callsign lookup via backend actor if supported.",
  "frontend/src/hooks/useUserRole.ts": "Fetches the caller's user role and admin status from the backend.",
  "frontend/src/hooks/useWebRtcPtt.ts": "Implements a WebRTC push‑to‑talk hook managing peer connection setup, media streams, signaling, and transmission state.",
  "frontend/src/index.css": "Defines Tailwind base styles and a dark radio‑themed OKLCH color palette with custom utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and mounts the root component.",
  "frontend/src/pages/AboutCompliancePage.tsx": "Renders an about/compliance page explaining PTTStar features and licensing requirements using styled panels.",
  "frontend/src/pages/ActivityPage.tsx": "Displays real‑time transmission activity with auto‑updating ‘Now Hearing’ data and manual refresh.",
  "frontend/src/pages/ConnectPage.tsx": "Provides UI to configure or clear IAX/DVSwitch connection settings with tabbed connect/disconnect views.",
  "frontend/src/pages/DirectoryPage.tsx": "Offers browsing of networks and management of personal directory entries via tabbed interface.",
  "frontend/src/pages/LandingPage.tsx": "Shows the marketing landing page with authentication entry point and feature highlights.",
  "frontend/src/pages/PttPage.tsx": "Push-to-talk page that loads the preferred connection, joins a WebRTC room, manages TX/RX state, handles mic permissions, and renders UI for transmitting audio.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page that loads and edits the user profile, performs QRZ callsign lookups, and saves license acknowledgement and profile fields.",
  "frontend/src/utils/roomKey.ts": "Utility to derive a deterministic WebRTC room key and human-readable label from IAX/DVSwitch or directory connection data.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, typography, animations, and plugin setup for the frontend.",
  "project_state.json": "Project metadata describing app purpose, architecture notes, known issues, and existing feature definitions."
}