{
  "backend/main.mo": "Defines the actor with user profiles, networks, transmissions, authorization mixin, and query/update methods for managing profiles and signaling state.",
  "feature_evidence.json": "Lists feature evidence records mapping feature IDs to affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Provides a mapping of frontend file paths to short functional descriptions of each component or page.",
  "frontend/docs/droidstar-settings-reference.md": "Documents the replicated DroidStar behaviors for server lists, caching, UI population, and normalization without reverse engineering.",
  "frontend/docs/promotions/version-23-preview-to-production.md": "Promotion checklist for Version 23 detailing deployment-only constraints and pre-production verification steps.",
  "frontend/docs/promotions/version-30-preview-to-production.md": "Promotion checklist for Version 30 noting no code changes allowed and outlining attestation and verification steps.",
  "frontend/docs/publish-preview-to-production.md": "Runbook detailing the steps and verification checks required to promote the preview build to production without code or config changes.",
  "frontend/index.css": "Tailwind-based global CSS defining light/dark theme variables and base styling for the application.",
  "frontend/index.html": "Main HTML entry point loading the PTTStar app root, metadata, PWA settings, and main TSX bundle.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, and display behavior for PTTStar.",
  "frontend/public/offline.html": "Standalone offline fallback page shown when the app cannot reach the network.",
  "frontend/public/sw.js": "Service worker implementing caching, offline support, and network-first fetch logic with exclusions for identity and canister requests.",
  "frontend/src/App.tsx": "Main app router and layout logic including authentication flow, redirects, and page routing via TanStack Router.",
  "frontend/src/auth/authClientStorage.ts": "LocalStorage adapter for namespaced regenerated auth data plus utilities to clear stored auth state.",
  "frontend/src/auth/iiAuthProvider.tsx": "React provider managing Internet Identity authentication lifecycle, status tracking, login behavior, and identity restoration.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches UI errors and displays a recovery screen with reset and session‑clear options.",
  "frontend/src/components/AppLayout.tsx": "Main app layout providing header, navigation, footer, and auth‑aware navigation visibility.",
  "frontend/src/components/AudioLevelMeter.tsx": "Displays a segmented audio input level meter driven by a custom audio‑level hook.",
  "frontend/src/components/AuthenticatedFlowFallback.tsx": "Error fallback UI for authenticated flows with retry and session‑clear actions.",
  "frontend/src/components/AuthGate.tsx": "Handles authentication and actor initialization, showing login prompts or fallback error states as needed.",
  "frontend/src/components/AutoGatewayStatusIndicator.tsx": "Shows inferred gateway auto‑configuration status and the detected preset type.",
  "frontend/src/components/ColorAccentPanel.tsx": "Simple wrapper for console‑style accent panels.",
  "frontend/src/components/ColorPageHeader.tsx": "Console‑style page header with title, subtitle, and optional icon.",
  "frontend/src/components/DigitalVoiceConnectForm.tsx": "Large form for configuring and saving Digital Voice connection settings with presets, validation, and auto‑loading.",
  "frontend/src/components/DigitalVoiceSavedConfigurationTab.tsx": "Displays saved Digital Voice connection details, shows missing field alerts, and provides masked credentials and gateway status.",
  "frontend/src/components/DirectoryBrowser.tsx": "Provides a searchable, filterable network directory with mode selection, favorites, and talkgroup selection handling.",
  "frontend/src/components/IaxDvswitchConnectForm.tsx": "Form for configuring IAX/DVSwitch connections with auto-prefill, validation, presets, and advanced settings.",
  "frontend/src/components/IaxDvswitchSavedConfigurationTab.tsx": "Shows saved IAX/DVSwitch configuration with masked sensitive fields and gateway status indicator.",
  "frontend/src/components/InstallAppAction.tsx": "Renders PWA install button and iOS installation instructions when applicable.",
  "frontend/src/components/LoginButton.tsx": "Handles login/logout actions, displays errors, and manages session clearing and retry logic.",
  "frontend/src/components/NowHearingList.tsx": "Displays recent radio transmissions with metadata, handling loading and empty states.",
  "frontend/src/components/PersonalDirectoryEntries.tsx": "Manages user-created local network entries with add, delete, and persistence via localStorage.",
  "frontend/src/components/PostLoginInterstitial.tsx": "Shows a blocking sign‑in progress screen with a timeout that reveals retry and session-clearing options.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Presents a required profile setup form for callsign, name, and license acknowledgement and saves via backend.",
  "frontend/src/components/PttControl.tsx": "Provides a push‑to‑talk button handling press states and transmit callbacks with visual feedback.",
  "frontend/src/components/RealTimeStatusBadge.tsx": "Displays real-time connection, transmit, or receive status with contextual icons and styling.",
  "frontend/src/components/TransmitDisclaimer.tsx": "Warns users that a license acknowledgement is required and links to settings to complete setup.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on authentication state and refreshes dependent queries on change.",
  "frontend/src/hooks/useActorWithError.ts": "Initializes a backend actor with authentication and invalidates other queries when ready, exposing actor state and errors.",
  "frontend/src/hooks/useAudioLevelMeter.ts": "Tracks microphone audio levels in real time using Web Audio API, managing stream and cleanup automatically.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches and saves the caller's user profile via actor methods with react‑query caching and error handling.",
  "frontend/src/hooks/useFavorites.ts": "Fetches favorite networks and toggles favorites through actor calls with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status management.",
  "frontend/src/hooks/useMicPttRecorder.ts": "Records microphone audio via MediaRecorder, handling permissions, errors, and returning a blob URL on completion.",
  "frontend/src/hooks/useNetworks.ts": "Fetches builtin networks and provides client‑side search and filtering using actor data.",
  "frontend/src/hooks/useNowHearing.ts": "Retrieves and polls real‑time transmissions and allows recording new activity with automatic query refresh.",
  "frontend/src/hooks/usePreferredConnection.ts": "Manages saving, loading, and validating preferred connection settings with type guards and normalization.",
  "frontend/src/hooks/usePwaInstall.ts": "Manages PWA installability state, detects iOS/standalone mode, listens for install events, and exposes an install prompt function.",
  "frontend/src/hooks/useQrzLookup.ts": "Provides a mutation that calls the backend actor's qrzLookup method to fetch callsign data.",
  "frontend/src/hooks/useRememberLoginPreference.ts": "Stores and retrieves the user's 'remember login' preference in localStorage, defaulting to true.",
  "frontend/src/hooks/useServerDirectories.ts": "Fetches, caches, and updates BrandMeister and AllStar server directory data with React Query and local fallbacks.",
  "frontend/src/hooks/useUserRole.ts": "Queries the backend for the caller's user role or admin status with retry logic.",
  "frontend/src/hooks/useWebRtcPtt.ts": "Implements WebRTC push‑to‑talk logic, managing peer connection setup, audio streams, signaling, and transmission state.",
  "frontend/src/index.css": "Defines Tailwind base styles and a radio‑console theme using OKLCH colors with custom utilities and components.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutCompliancePage.tsx": "Displays project information, purpose, and licensing requirements using styled cards and panels.",
  "frontend/src/pages/ActivityPage.tsx": "Shows live transmission activity with a refreshable Now Hearing list and page header UI.",
  "frontend/src/pages/ConnectPage.tsx": "Renders the connection setup page with tabs for IAX/DVSwitch and Digital Voice, handling presets, saved connections, and quick setup flow.",
  "frontend/src/pages/DirectoryPage.tsx": "Provides a browser for networks and talkgroups, letting users pick a directory entry and navigate to PTT with the selected configuration.",
  "frontend/src/pages/LandingPage.tsx": "Displays the app landing page with an overview, requirements, and getting-started information for PTTStar.",
  "frontend/src/pages/PttPage.tsx": "Loads the active connection and manages WebRTC push‑to‑talk controls, audio levels, activity list, and auto-connect behaviors.",
  "frontend/src/pages/SettingsPage.tsx": "Allows users to edit their profile, license acknowledgement, login preference, and server directory sources, with save and refresh actions.",
  "frontend/src/utils/connectionPresets.ts": "Defines preset IDs, metadata, and helper functions for mapping presets to forms and retrieving preset lists.",
  "frontend/src/utils/digitalVoiceGatewayClient.ts": "Implements a WebRTC signaling client over WebSocket for Digital Voice gateways, handling connection setup, join metadata, and message routing.",
  "frontend/src/utils/gatewayUrlBootstrap.ts": "Extracts gateway-related URL parameters, stores them in sessionStorage, and infers connection presets like BrandMeister, TGIF, or AllStar.",
  "frontend/src/utils/roomKey.ts": "Derives stable room keys and human-readable labels based on normalized connection settings.",
  "frontend/src/utils/serverAddress.ts": "Provides server address normalization and equality checks for consistent comparison and storage.",
  "frontend/src/utils/serverDirectoryCache.ts": "Implements localStorage-backed caching for BrandMeister and AllStar server directories with TTL tracking.",
  "frontend/src/utils/serverDirectoryFetch.ts": "Fetches and parses BrandMeister and AllStar server lists from remote sources with timeout and error handling.",
  "frontend/src/utils/serverDirectorySources.ts": "Manages configurable GitHub URLs and metadata for server directory sources with persistence.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, fonts, spacing, and animations, plus plugin setup for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing IAX/DVSwitch UI redesign goals, existing features, and pending feature requests such as phone-to-IAX mode and codec selection."
}