{
  "backend/main.mo": "Motoko canister defining authorization mixin, radio network types, transmission records, user profile storage and access, plus signaling and activity state.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short descriptions of their functionality and recent updates.",
  "frontend/docs/promotions/version-23-preview-to-production.md": "Promotion record template for Version 23 including checklists for verifying preview before production deployment.",
  "frontend/docs/promotions/version-30-preview-to-production.md": "Draft promotion record for Version 30 with attestation and detailed verification checklists.",
  "frontend/docs/publish-preview-to-production.md": "Runbook describing the process and required verification steps for promoting preview builds to production without code changes.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, applying global background, text, and border styles.",
  "frontend/index.html": "HTML entry point setting metadata, PWA manifest, iOS support, and loading the main frontend script.",
  "frontend/public/manifest.webmanifest": "PWA manifest describing app metadata, colors, icons, and display settings.",
  "frontend/public/offline.html": "Standalone offline fallback page with basic styling and a retry button.",
  "frontend/public/sw.js": "Service worker handling caching, updating, and offline fallbacks with a network‑first strategy.",
  "frontend/src/App.tsx": "Sets up app routing, auth‑aware redirection, profile onboarding logic, and root layout integration.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that displays an error UI with reset and session‑clear options.",
  "frontend/src/components/AppLayout.tsx": "Main layout providing header, navigation, footer, authentication‑aware nav items, and branding.",
  "frontend/src/components/AudioLevelMeter.tsx": "Displays a segmented audio input level meter using audio level data from a custom hook.",
  "frontend/src/components/AuthenticatedFlowFallback.tsx": "Displays an error screen for authenticated users when an operation fails, offering retry and session-clearing actions.",
  "frontend/src/components/AuthGate.tsx": "Controls authentication flow, showing login prompts, handling login errors, and gating children until identity and actor initialization succeed.",
  "frontend/src/components/ColorAccentPanel.tsx": "Provides a neutral-styled bordered container for accenting content without bright colors.",
  "frontend/src/components/ColorPageHeader.tsx": "Renders a styled page header with optional icon, title, and subtitle for different page variants.",
  "frontend/src/components/DigitalVoiceConnectForm.tsx": "Manages creation and editing of Digital Voice connection settings, loading saved values and supporting presets like BrandMeister DMR.",
  "frontend/src/components/DigitalVoiceSavedConfigurationTab.tsx": "Shows the user’s saved Digital Voice configuration, highlighting missing fields and gateway readiness with masked sensitive data.",
  "frontend/src/components/DirectoryBrowser.tsx": "Displays a searchable, filterable directory of networks and talkgroups, supporting favorites and selection handling.",
  "frontend/src/components/IaxDvswitchConnectForm.tsx": "Handles configuration for IAX/DVSwitch connections, including validation, presets like AllStar, and persistence to storage.",
  "frontend/src/components/IaxDvswitchSavedConfigurationTab.tsx": "Displays saved IAX/DVSwitch connection settings or a notice if none exist, including masked credentials and server info.",
  "frontend/src/components/InstallAppAction.tsx": "Shows an install button for the PWA and provides iOS-specific installation instructions in a dialog.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity login/logout with retry and error handling, clearing cache and showing error alerts when needed.",
  "frontend/src/components/NowHearingList.tsx": "Renders a list of recent transmissions with metadata or shows loading/empty states.",
  "frontend/src/components/PersonalDirectoryEntries.tsx": "Manages local personal directory entries with add, delete, and persistence in localStorage.",
  "frontend/src/components/PostLoginInterstitial.tsx": "Shows a fullscreen loading screen while finalizing user sign‑in.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog for initial user profile setup with callsign, name, license acknowledgement, and validation.",
  "frontend/src/components/PttControl.tsx": "Push‑to‑talk button component handling press states and transmit callbacks with visual feedback.",
  "frontend/src/components/RealTimeStatusBadge.tsx": "Renders a badge showing connection or transmission status based on props, choosing icons and styles dynamically.",
  "frontend/src/components/TransmitDisclaimer.tsx": "Displays a warning alert requiring users to acknowledge their amateur radio license with a link to settings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useActorWithError.ts": "Similar to useActor but adds detailed error handling, retries, and guarded query invalidation.",
  "frontend/src/hooks/useAudioLevelMeter.ts": "Captures microphone audio levels in real time using Web Audio API and reports normalized volume and activity state.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to fetch and save the caller's user profile using the backend actor with retries and cache invalidation.",
  "frontend/src/hooks/useFavorites.ts": "Manages fetching and toggling a user's favorite networks through backend actor calls with cached updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context providing login, logout, and identity persistence using AuthClient.",
  "frontend/src/hooks/useMicPttRecorder.ts": "Handles push‑to‑talk audio recording via MediaRecorder, producing a blob URL and tracking recording state and errors.",
  "frontend/src/hooks/useNetworks.ts": "Fetches builtin networks and performs client‑side filtering for search queries using the backend actor.",
  "frontend/src/hooks/useNowHearing.ts": "Provides React Query hooks to fetch and update real-time \"now hearing\" transmission data via the backend actor.",
  "frontend/src/hooks/usePreferredConnection.ts": "Defines connection types and helpers for storing, identifying, and validating user-selected network connection settings.",
  "frontend/src/hooks/usePwaInstall.ts": "Manages PWA installability state, detects iOS support limits, and exposes a function to trigger installation prompts.",
  "frontend/src/hooks/useQrzLookup.ts": "Implements a mutation to perform QRZ callsign lookups through the backend actor if supported.",
  "frontend/src/hooks/useRememberLoginPreference.ts": "Stores and retrieves a user preference for remembering login status using localStorage.",
  "frontend/src/hooks/useUserRole.ts": "Provides React Query hooks to fetch the caller's user role and admin status from the backend actor.",
  "frontend/src/hooks/useWebRtcPtt.ts": "Implements WebRTC push-to-talk logic including room joining, audio handling, signaling, and gateway support.",
  "frontend/src/index.css": "Defines Tailwind-based dark theme variables, global styles, and utility classes for the UI.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider, then renders App.",
  "frontend/src/pages/AboutCompliancePage.tsx": "Renders an informational page describing PTTStar, its creator, features, and licensing requirements.",
  "frontend/src/pages/ActivityPage.tsx": "Displays a real‑time activity feed using NowHearingList with manual refresh and header panels.",
  "frontend/src/pages/ConnectPage.tsx": "Provides connection setup UI for IAX/DVSwitch and Digital Voice, handling presets, saved configs, and quick-setup flows.",
  "frontend/src/pages/DirectoryPage.tsx": "Lets users browse networks and talkgroups, manage personal entries, and save a directory-based connection before navigating to PTT.",
  "frontend/src/pages/LandingPage.tsx": "Landing and onboarding page explaining requirements and guiding users toward setup and app navigation.",
  "frontend/src/pages/PttPage.tsx": "Controls WebRTC push‑to‑talk sessions, manages connection validation, auto-connect logic, and shows real‑time activity and status.",
  "frontend/src/pages/SettingsPage.tsx": "Allows users to edit and save profile data, license acknowledgement, and login preferences, with blockchain‑synced profile loading.",
  "frontend/src/utils/digitalVoiceGatewayClient.ts": "Implements a WebRTC signaling client over WebSocket for Digital Voice gateways, handling join metadata and SDP/ICE messaging.",
  "frontend/src/utils/roomKey.ts": "Generates normalized room keys and human-readable labels based on various connection types and metadata.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning hash params.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, animations, and container settings.",
  "project_state.json": "Describes the project state, existing features, and pending requests for refining post-login transitions."
}