{
  "backend/main.mo": "Motoko backend actor defining radio types, user profiles, signaling messages, and access‑controlled profile queries and updates.",
  "feature_evidence.json": "Feature evidence report listing promotion-related features, associated files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Text file mapping frontend source file paths to brief summaries of their functionality and behavior.",
  "frontend/docs/deployments/README.md": "Index describing production deployment records, current version status, process overview, and access details.",
  "frontend/docs/deployments/version-30-production-deployment.md": "Detailed record for Version 30 clean production deployment, including canister info, verification steps, and monitoring.",
  "frontend/docs/deployments/version-55-production-deployment.md": "Record for Version 55 promotion deployment with canister details, verification results, and production access info.",
  "frontend/docs/droidstar-settings-reference.md": "Explains how the app replicates DroidStar behaviors including server list fetching, caching, UI population, and connection consistency without reverse‑engineering the APK.",
  "frontend/docs/promotions/README.md": "Provides an index of promotion records, current production version details, promotion workflow, principles, and verification checklist.",
  "frontend/docs/promotions/version-23-preview-to-production.md": "Contains the promotion record for Version 23 with required checklists and verification steps for a deployment‑only promotion.",
  "frontend/docs/promotions/version-30-preview-to-production.md": "Documents Version 30 promotion requirements, attestation, and detailed preview verification checklists for deployment‑only promotion.",
  "frontend/docs/promotions/version-55-preview-to-production.md": "Records Version 55 promotion with completed verification results, attestation, and status for all major application flows.",
  "frontend/docs/publish-preview-to-production.md": "Runbook describing the required steps and verification checklists for promoting a preview build to production without code changes.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes plus base element styling.",
  "frontend/index.html": "Main HTML entry point configuring PWA metadata and loading the React app root.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, and launch settings.",
  "frontend/public/offline.html": "Static offline fallback page with minimal styling and a retry button.",
  "frontend/public/sw.js": "Service worker implementing caching, offline handling, and network-first fetch strategy.",
  "frontend/src/App.tsx": "Main application router and auth-driven navigation logic including post-login redirects.",
  "frontend/src/auth/authClientStorage.ts": "Namespaced localStorage adapter for regenerated Internet Identity auth and utilities to clear stored keys.",
  "frontend/src/auth/iiAuthProvider.tsx": "React provider managing Internet Identity authentication lifecycle, login flow, and identity state.",
  "frontend/src/components/AppErrorBoundary.tsx": "Error boundary component that displays fallback UI and supports session clearing and retry.",
  "frontend/src/components/AppLayout.tsx": "Main layout wrapper providing header, navigation, footer, and mobile nav based on auth state and current route.",
  "frontend/src/components/AudioLevelMeter.tsx": "Displays a 20‑segment audio input meter that updates based on measured audio level and disabled state.",
  "frontend/src/components/AuthenticatedFlowFallback.tsx": "Fallback UI showing error details and retry/clear-session options when authenticated flows fail.",
  "frontend/src/components/AuthGate.tsx": "Protects authenticated routes by handling login, error states, and actor initialization before rendering children.",
  "frontend/src/components/AutoGatewayStatusIndicator.tsx": "Shows whether gateway auto‑configuration is active and displays the inferred preset label.",
  "frontend/src/components/ColorAccentPanel.tsx": "Simple wrapper applying console‑style panel styling with optional variant and class overrides.",
  "frontend/src/components/ColorPageHeader.tsx": "Renders a console‑style page header with title, subtitle, and optional icon for various page variants.",
  "frontend/src/components/DigitalVoiceConnectForm.tsx": "Large form for configuring Digital Voice connections, handling presets, validation, credentials, and auto‑loading saved settings.",
  "frontend/src/components/DigitalVoiceSavedConfigurationTab.tsx": "Displays saved Digital Voice configuration with masking, missing‑field checks, and option to edit or view gateway status.",
  "frontend/src/components/DirectoryBrowser.tsx": "Provides a searchable, filterable network directory UI with mode tabs, favorites, and talkgroup selection handling.",
  "frontend/src/components/IaxDvswitchConnectForm.tsx": "Implements a form for configuring and saving IAX/DVSwitch connection settings, including advanced fields and preset loading.",
  "frontend/src/components/IaxDvswitchSavedConfigurationTab.tsx": "Displays saved IAX/DVSwitch connection details with masked sensitive fields and an optional edit action.",
  "frontend/src/components/InstallAppAction.tsx": "Shows a PWA install button and iOS-specific installation instructions when applicable.",
  "frontend/src/components/LoginButton.tsx": "Manages login/logout actions with error handling, retry logic, and session clearing.",
  "frontend/src/components/NowHearingList.tsx": "Renders a real-time list of recent transmissions with callsign, network, talkgroup, and metadata.",
  "frontend/src/components/PersonalDirectoryEntries.tsx": "Manages local personal radio directory entries with add/delete UI and localStorage persistence.",
  "frontend/src/components/PostLoginInterstitial.tsx": "Shows a loading screen during sign-in and displays a timeout error with retry options after 12 seconds.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts new users to enter callsign and optional name, acknowledge license, and saves the profile.",
  "frontend/src/components/PttControl.tsx": "Implements a push‑to‑talk button handling press/release events and transmit state visuals.",
  "frontend/src/components/RealTimeStatusBadge.tsx": "Displays a status badge reflecting connection, transmitting, or receiving states.",
  "frontend/src/components/TransmitDisclaimer.tsx": "Warns users they must acknowledge a valid license before using voice features with link to settings.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useActorWithError.ts": "Like useActor but adds detailed logging, retry logic, and exposes initialization errors.",
  "frontend/src/hooks/useAudioLevelMeter.ts": "Captures microphone audio and computes a live normalized audio level with cleanup handling.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to fetch and save the current user's profile via a backend actor with query invalidation.",
  "frontend/src/hooks/useFavorites.ts": "Implements hooks to fetch and toggle a user's favorite networks using react-query and actor methods.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines an Internet Identity context and provider handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useMicPttRecorder.ts": "Manages microphone push-to-talk recording, producing an audio blob URL and handling permission errors.",
  "frontend/src/hooks/useNetworks.ts": "Exposes hooks to fetch builtin networks and perform client-side search filtering via actor data.",
  "frontend/src/hooks/useNowHearing.ts": "Provides hooks to poll and update real-time transmission activity with backend synchronization.",
  "frontend/src/hooks/usePreferredConnection.ts": "Handles saving, loading, validating, and clearing preferred connection configurations in session storage.",
  "frontend/src/hooks/usePwaInstall.ts": "Tracks PWA installability, iOS detection, installation state, and exposes a prompt to trigger install.",
  "frontend/src/hooks/useQrzLookup.ts": "Wraps a backend QRZ lookup call in a mutation with runtime method validation.",
  "frontend/src/hooks/useRememberLoginPreference.ts": "Stores and retrieves a persistent 'remember login' preference using localStorage.",
  "frontend/src/hooks/useServerDirectories.ts": "React Query hooks manage server directory sources and cached BrandMeister/AllStar server lists with failure‑tolerant fetching.",
  "frontend/src/hooks/useUserRole.ts": "Provides hooks to fetch the caller's role and admin status via an actor with retry logic.",
  "frontend/src/hooks/useWebRtcPtt.ts": "Implements WebRTC push‑to‑talk state, signaling, media handling, and cleanup for joining and transmitting in voice rooms.",
  "frontend/src/index.css": "Defines Tailwind base theme with OKLCH console-style colors and utility classes for status lights and console components.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AboutCompliancePage.tsx": "Renders informational content about PTTStar, its creator, features, and licensing requirements.",
  "frontend/src/pages/ActivityPage.tsx": "Displays auto-updating recent transmission activity with manual refresh and a Now Hearing list.",
  "frontend/src/pages/ConnectPage.tsx": "Provides UI for configuring digital voice or IAX/DMR connections, handling presets, saved configs, and tab selection.",
  "frontend/src/pages/DirectoryPage.tsx": "Renders the network directory page, allowing users to browse networks and talkgroups and initiate a PTT connection based on selections.",
  "frontend/src/pages/LandingPage.tsx": "Displays the app landing page with an introduction, requirements, and onboarding guidance for new users.",
  "frontend/src/pages/PttPage.tsx": "Implements the main PTT interface, managing connection state, WebRTC audio, room joining, and live activity display.",
  "frontend/src/pages/SettingsPage.tsx": "Provides user profile management, server directory configuration, and preference settings with validation and save actions.",
  "frontend/src/utils/connectionPresets.ts": "Defines preset connection types for digital voice and IAX networks and provides helper functions to query preset metadata.",
  "frontend/src/utils/digitalVoiceGatewayClient.ts": "Implements a WebRTC signaling client for digital voice gateways, handling websocket signaling, metadata exchange, and SDP messaging.",
  "frontend/src/utils/gatewayUrlBootstrap.ts": "No summary available.",
  "frontend/src/utils/roomKey.ts": "Generates stable room keys and human-readable labels based on connection settings using normalized addresses.",
  "frontend/src/utils/serverAddress.ts": "Normalizes server addresses for consistent comparison and provides an equality check wrapper.",
  "frontend/src/utils/serverDirectoryCache.ts": "Caches BrandMeister and AllStar directory lists in localStorage with timestamps and TTL warnings.",
  "frontend/src/utils/serverDirectoryFetch.ts": "Fetches and parses BrandMeister and AllStar server lists with timeout handling and basic line parsing.",
  "frontend/src/utils/serverDirectorySources.ts": "Manages storage and defaults for server list source URLs and related metadata in localStorage.",
  "frontend/src/utils/urlParams.ts": "Extracts URL parameters (including hash routing), persists them in sessionStorage, and provides cleanup utilities.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the frontend.",
  "project_state.json": "Defines overall project state, listing existing features, new feature requests, known issues, and metadata for the promotion process of a preview build to production. Contains project configuration, status tracking, and documentation requirements."
}