{
  "backend/main.mo": "Motoko backend defining user profiles, networks, transmissions, access control, and related state with authorization checks and profile save/query functions.",
  "feature_evidence.json": "Feature evidence report listing features, impacted files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose and behavior of various frontend source files.",
  "frontend/docs/deployments/README.md": "Index of production deployment records outlining deployment history, processes, access info, and monitoring guidance.",
  "frontend/docs/deployments/version-30-production-deployment.md": "Deployment record for Version 30 documenting a clean production deployment, verification steps, and post-deployment checks.",
  "frontend/docs/deployments/version-55-production-deployment.md": "Deployment record for Version 55 covering promotion details, canister info, verification results, and production access information.",
  "frontend/docs/deployments/version-56-production-deployment.md": "Production deployment record for Version 56 detailing canister info, deployment steps, verification tasks, and key features such as enhanced authorization handling.",
  "frontend/docs/droidstar-settings-reference.md": "Reference describing how the app replicates DroidStar client behavior for server lists, caching, UI population, and connection consistency without reverse engineering.",
  "frontend/docs/promotions/README.md": "Index of all preview‑to‑production promotions with status, history, workflows, and verification checklists, highlighting Version 56 as current production.",
  "frontend/docs/promotions/version-23-preview-to-production.md": "Promotion record for Version 23 outlining required pre‑promotion verification across authentication, Connect pages, PTT, activity, and settings.",
  "frontend/docs/promotions/version-30-preview-to-production.md": "Promotion record for Version 30 including attestation of no code changes and extensive preview verification checklists for all major app areas.",
  "frontend/docs/promotions/version-55-preview-to-production.md": "Promotion record for Version 55 with completed verification of authentication, Connect tabs, Digital Voice presets, PTT behavior, and related functionality.",
  "frontend/docs/promotions/version-56-preview-to-production.md": "Records verification results for promoting version 56 preview build to production across all app pages and PWA features.",
  "frontend/docs/publish-preview-to-production.md": "Runbook detailing required checks and steps for promoting a preview deployment to production without code changes.",
  "frontend/index.css": "Defines Tailwind base layers and CSS variables for light and dark themes with global styling rules.",
  "frontend/index.html": "HTML entry point that sets up PWA metadata and loads the main React application.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, colors, and startup behavior.",
  "frontend/public/offline.html": "Standalone offline fallback page shown when the app has no network connection.",
  "frontend/public/sw.js": "Service worker implementing install, activate, and fetch handlers for caching and offline support.",
  "frontend/src/App.tsx": "Main React router setup with authentication flow handling, redirects, and page layout composition.",
  "frontend/src/auth/authClientStorage.ts": "Provides namespaced localStorage adapter and utilities for regenerated Internet Identity auth data.",
  "frontend/src/auth/iiAuthProvider.tsx": "Provides React context for Internet Identity authentication, handling client initialization, login flow, and session state.",
  "frontend/src/components/AppErrorBoundary.tsx": "Implements a React error boundary that shows a styled error screen with reset and session-clearing options.",
  "frontend/src/components/AppLayout.tsx": "Defines the main application layout with header, footer, navigation, and authentication-aware menu visibility.",
  "frontend/src/components/AudioLevelMeter.tsx": "Displays a segmented audio level meter driven by microphone input via a custom hook.",
  "frontend/src/components/AuthenticatedFlowFallback.tsx": "Renders a fallback UI when authenticated backend operations fail, providing retry and session-clear actions.",
  "frontend/src/components/AuthGate.tsx": "Protects authenticated routes, handling login prompts, actor initialization errors, and session-clearing actions.",
  "frontend/src/components/AutoGatewayStatusIndicator.tsx": "Shows gateway auto-configuration status based on detected presets and displays related info.",
  "frontend/src/components/ColorAccentPanel.tsx": "Wraps children in a console-style accent panel for consistent UI styling.",
  "frontend/src/components/ColorPageHeader.tsx": "Renders a styled page header with title, subtitle, and optional icon for various app sections.",
  "frontend/src/components/DigitalVoiceConnectForm.tsx": "A complex form component for configuring and saving Digital Voice (DMR/TGIF/BrandMeister) connections, including credentials, gateway fields, presets, and auto-loading saved settings.",
  "frontend/src/components/DigitalVoiceSavedConfigurationTab.tsx": "Displays the user's saved Digital Voice configuration with validation warnings and gateway status, offering an option to edit settings.",
  "frontend/src/components/DirectoryBrowser.tsx": "Provides a searchable, filterable directory of networks and talkgroups with favorites support and selection handlers.",
  "frontend/src/components/IaxDvswitchConnectForm.tsx": "Form for configuring and saving IAX/DVSwitch connection settings, including hostname, credentials, codec, and advanced AllStar fields.",
  "frontend/src/components/IaxDvswitchSavedConfigurationTab.tsx": "Shows saved IAX/DVSwitch configuration details with masked passwords and gateway status, and allows navigating to edit.",
  "frontend/src/components/InstallAppAction.tsx": "Handles PWA installation flow, showing an install button or iOS-specific instructions when applicable.",
  "frontend/src/components/LoginButton.tsx": "Provides login/logout button logic with error handling, session clearing, and retry flow using auth hooks and React Query.",
  "frontend/src/components/NowHearingList.tsx": "Displays a list of recent transmissions with metadata, loading state, and empty-state messaging.",
  "frontend/src/components/PersonalDirectoryEntries.tsx": "Manages a local-only list of personal network entries with add, delete, and persistent localStorage storage.",
  "frontend/src/components/PostLoginInterstitial.tsx": "Shows a post‑login loading screen with a timeout state offering retry and session‑clear options.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog collecting initial user profile info with validation and submission via a profile‑save hook.",
  "frontend/src/components/PttClipRecorderPanel.tsx": "UI for recording, previewing, discarding, and uploading short audio clips with mic error handling.",
  "frontend/src/components/PttControl.tsx": "Push‑to‑talk button handling press/hold interactions and transmit state indicators.",
  "frontend/src/components/RealTimeStatusBadge.tsx": "Displays a status badge showing connection, transmitting, or receiving state with appropriate icons and styles.",
  "frontend/src/components/ReceivedClipsPanel.tsx": "Fetches, lists, and plays received audio clips with playback controls and error/loading handling.",
  "frontend/src/components/TransmitDisclaimer.tsx": "Shows a warning alert requiring users to acknowledge holding a valid radio license before real-time voice use.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useActorWithError.ts": "Like useActor but adds detailed error logging, retry logic, and controlled query invalidation.",
  "frontend/src/hooks/useAudioLevelMeter.ts": "Tracks microphone audio levels using Web Audio API and returns current level and active state.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to fetch and save the current user profile with actor-based error and retry handling.",
  "frontend/src/hooks/useFavorites.ts": "Fetches and toggles favorite networks using actor calls and react-query caching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and stored identities via AuthClient.",
  "frontend/src/hooks/useMicPttRecorder.ts": "Provides a hook for starting, stopping, and resetting microphone recordings using MediaRecorder, returning blob data and error states.",
  "frontend/src/hooks/useNetworks.ts": "Hooks for fetching builtin networks and client-side searching/filtering using React Query and an actor API.",
  "frontend/src/hooks/useNowHearing.ts": "Hooks for polling current transmissions and updating Now Hearing activity through the backend actor.",
  "frontend/src/hooks/usePreferredConnection.ts": "Manages saving, loading, and validating preferred connection settings in sessionStorage with type guards and normalization.",
  "frontend/src/hooks/usePttClipUpload.ts": "Defines a mutation for uploading recorded audio clips to a configured HTTP endpoint with error handling.",
  "frontend/src/hooks/usePwaInstall.ts": "Handles PWA installation prompts and state detection for installability, iOS conditions, and standalone mode.",
  "frontend/src/hooks/useQrzLookup.ts": "Provides a mutation to perform QRZ callsign lookups via the backend actor if supported.",
  "frontend/src/hooks/useReceivedClips.ts": "Fetches and normalizes received audio clips from a configured endpoint with React Query.",
  "frontend/src/hooks/useRememberLoginPreference.ts": "Stores and retrieves the 'remember login' preference using localStorage with default-on behavior.",
  "frontend/src/hooks/useServerDirectories.ts": "Manages server directory sources and cached BrandMeister/AllStar server lists with failure-tolerant fetching.",
  "frontend/src/hooks/useUserRole.ts": "Fetches the caller's user role and admin status using React Query and the backend actor.",
  "frontend/src/hooks/useWebRtcPtt.ts": "Implements a React hook managing WebRTC PTT audio flow, signaling, peer connection setup, and gateway integration.",
  "frontend/src/index.css": "Defines Tailwind-based global styles and OKLCH theme variables for the app’s radio-console UI aesthetic.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutCompliancePage.tsx": "Renders an informational page describing PTTStar, its purpose, licensing requirements, and creator details.",
  "frontend/src/pages/ActivityPage.tsx": "Displays a live-updating list of current transmissions with manual refresh and activity status components.",
  "frontend/src/pages/ConnectPage.tsx": "Provides connection configuration UI with presets, tabs, and forms for IAX-DVSwitch and digital voice modes.",
  "frontend/src/pages/DirectoryPage.tsx": "Allows browsing networks and talkgroups, selecting entries, saving connections, and navigating to the PTT interface.",
  "frontend/src/pages/LandingPage.tsx": "Renders the landing page with app introduction, requirements, and getting-started guidance for PTTStar.",
  "frontend/src/pages/PttPage.tsx": "Implements the main push‑to‑talk interface, managing WebRTC PTT connections, status, audio levels, and activity lists.",
  "frontend/src/pages/SettingsPage.tsx": "Provides user profile editing, server directory configuration, login preference options, and PTT clip HTTP settings.",
  "frontend/src/utils/authErrors.ts": "Utility functions for detecting, classifying, and extracting messages from backend authorization errors.",
  "frontend/src/utils/clearClientSession.ts": "Clears all app‑related localStorage and sessionStorage keys to reset client‑side session state.",
  "frontend/src/utils/connectionPresets.ts": "Defines preset metadata for connection types and helper functions for filtering and retrieving preset info.",
  "frontend/src/utils/digitalVoiceGatewayClient.ts": "Implements a WebRTC signaling client over WebSocket for connecting to digital voice gateways with support for BrandMeister and TGIF metadata.",
  "frontend/src/utils/gatewayUrlBootstrap.ts": "Captures gateway-related URL params, stores them in sessionStorage, and infers connection presets. Also tracks whether auto-flow was attempted.",
  "frontend/src/utils/pttClipHttpConfig.ts": "Manages localStorage-backed config for PTT clip HTTP URLs with validation helpers. Provides load, save, and URL validation functions.",
  "frontend/src/utils/roomKey.ts": "Generates stable room keys and labels from connection settings using normalized server addresses. Supports IAX, digital voice, and directory-based connections.",
  "frontend/src/utils/serverAddress.ts": "Normalizes server addresses for comparison and key generation and provides an equality check. Ensures consistent lowercase, trimmed formatting.",
  "frontend/src/utils/serverDirectoryCache.ts": "Caches BrandMeister and AllStar server directory lists in localStorage with timestamps. Supports reading, writing, clearing, and checking cache age.",
  "frontend/src/utils/serverDirectoryFetch.ts": "Fetches and parses server lists with timeout handling for BrandMeister and AllStar sources. Includes line-based parsers for each list format.",
  "frontend/src/utils/serverDirectorySources.ts": "Manages persistent GitHub source URLs and metadata for server directories with defaults. Supports reading, updating, and resetting sources and metadata.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params from query or hash, persist them in sessionStorage, and manage stored parameters. Includes utilities for clearing parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, spacing, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project status, issues, existing features, and new feature requests related to deploying the app and fixing backend authorization errors."
}