{
  "backend/main.mo": "Defines the main canister with authorization mixin, user profile storage, network and transmission types, signaling list, and profile/network query and save functions.",
  "backend/migration.mo": "Adds a migration step that introduces an empty signalMessages list when upgrading from the old actor state.",
  "feature_evidence.json": "Contains feature evidence entries mapping features to related frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten short summaries for numerous frontend source files for reference or tooling.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, light/dark mode tokens, and base styles.",
  "frontend/index.html": "HTML entry point loading the React app root and main script.",
  "frontend/src/App.tsx": "Configures TanStack Router, route definitions, authentication gating, and profile setup dialog logic.",
  "frontend/src/components/AppLayout.tsx": "Shared layout with header, navigation, footer, and authenticated/unauthenticated nav item visibility.",
  "frontend/src/components/AudioLevelMeter.tsx": "Displays a segmented audio level bar that updates from a hook and shows active/inactive status.",
  "frontend/src/components/AuthGate.tsx": "Blocks access until the user is authenticated with Internet Identity, showing a login prompt if not.",
  "frontend/src/components/DirectoryBrowser.tsx": "Provides searchable, filterable browsing of digital voice networks and talkgroups with favorite toggling.",
  "frontend/src/components/IaxDvswitchConnectForm.tsx": "Form for configuring and saving IAX/DVSwitch connection settings before navigating to the PTT page.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and query cache reset.",
  "frontend/src/components/NowHearingList.tsx": "Shows recent real‑time transmissions with metadata or a loading/empty state.",
  "frontend/src/components/PersonalDirectoryEntries.tsx": "Manages user-defined local directory entries with add, list, and delete functionality.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog for initial user profile setup including callsign, name, and license acknowledgement.",
  "frontend/src/components/PttControl.tsx": "Push-to-talk button component handling press state, visual feedback, and transmit callbacks.",
  "frontend/src/components/RealTimeStatusBadge.tsx": "Displays connection, transmit/receive status, and room label using badges and icons.",
  "frontend/src/components/TransmitDisclaimer.tsx": "Warning alert requiring users to acknowledge a valid radio license with link to settings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor instances tied to identity and refreshes dependent queries.",
  "frontend/src/hooks/useAudioLevelMeter.ts": "Tracks microphone audio level in real time using Web Audio API with lifecycle cleanup.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches and saves the caller’s user profile via the backend actor with react-query.",
  "frontend/src/hooks/useFavorites.ts": "Retrieves and toggles favorite networks using backend actor queries and mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading, login, and identity lifecycle management.",
  "frontend/src/hooks/useMicPttRecorder.ts": "Implements push-to-talk microphone recording using MediaRecorder with error handling.",
  "frontend/src/hooks/useNetworks.ts": "Fetches builtin networks and performs client-side search filtering via react-query.",
  "frontend/src/hooks/useNowHearing.ts": "Fetches and updates real-time 'now hearing' transmissions with polling support.",
  "frontend/src/hooks/usePreferredConnection.ts": "Manages saving, loading, and clearing preferred connection settings with legacy compatibility.",
  "frontend/src/hooks/useQrzLookup.ts": "Runs a QRZ callsign lookup mutation via the backend if supported.",
  "frontend/src/hooks/useUserRole.ts": "Fetches the caller’s user role and admin status from the backend.",
  "frontend/src/hooks/useWebRtcPtt.ts": "Custom hook managing WebRTC push‑to‑talk logic, including peer connection setup, signaling, audio streams, and state tracking.",
  "frontend/src/index.css": "Tailwind CSS base/theme definitions with custom color variables and status utility classes for the app’s dark radio‑style UI.",
  "frontend/src/main.tsx": "App entry point that mounts React, sets up React Query, Internet Identity provider, and loads global styles.",
  "frontend/src/pages/AboutCompliancePage.tsx": "Page explaining PTTStar’s purpose and amateur‑radio licensing/compliance requirements with informational cards and alerts.",
  "frontend/src/pages/ActivityPage.tsx": "Displays live and recent transmission activity with auto‑updating data and a manual refresh option.",
  "frontend/src/pages/ConnectPage.tsx": "Provides UI for configuring or clearing IAX/DVSwitch connection settings using tabbed forms.",
  "frontend/src/pages/DirectoryPage.tsx": "Network directory browser with tabs for browsing networks and managing personal directory entries.",
  "frontend/src/pages/LandingPage.tsx": "Landing page introducing PTTStar, offering login or navigation to connection settings, features, and compliance info.",
  "frontend/src/pages/PttPage.tsx": "Renders the Push-to-Talk screen, manages connection loading, room joining, WebRTC PTT state, mic recording fallback, and UI for transmit/receive/error states.",
  "frontend/src/pages/SettingsPage.tsx": "Provides user profile editing with callsign, name, and license acknowledgment, plus QRZ lookup and form validation with save and lookup actions.",
  "frontend/src/utils/roomKey.ts": "Generates stable room keys and human-readable labels based on stored connection types like IAX/DVSwitch or directory connections.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, typography, animations, and plugin setup for the frontend.",
  "project_state.json": "Metadata describing project version, architecture notes, existing features, and overall app purpose for PTTStar."
}