{
  "backend/main.mo": "Actor defines user profiles, network data, transmissions, and authorization checks with persistent storage using Map and List structures.",
  "feature_evidence.json": "Report listing two CSS-related features, their affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-like collection of short descriptions for various frontend files summarizing their responsibilities.",
  "frontend/index.css": "Tailwind base styles plus OKLCH variable definitions for light/dark themes and global background/foreground setup.",
  "frontend/index.html": "Basic HTML entry file mounting the root div and loading the frontend script.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, authentication handling, and root layout with optional profile setup dialog.",
  "frontend/src/components/AppLayout.tsx": "Top-level UI layout with header, footer, responsive navigation, and consistent dark background.",
  "frontend/src/components/AudioLevelMeter.tsx": "Displays a segmented audio level meter driven by Web Audio API readings with color‑coded segments.",
  "frontend/src/components/AuthGate.tsx": "Route guard that blocks access when unauthenticated and shows a login prompt card.",
  "frontend/src/components/ColorAccentPanel.tsx": "Neutral dark-themed panel component providing a subtle bordered container without bright accents.",
  "frontend/src/components/ColorPageHeader.tsx": "Renders a styled page header with optional icon, title, and subtitle based on variant. Provides a simple card-style layout.",
  "frontend/src/components/DirectoryBrowser.tsx": "Displays and filters a list of digital voice networks with search, mode tabs, favorites, and talkgroup selection. Handles network selection and favorite toggling.",
  "frontend/src/components/IaxDvswitchConnectForm.tsx": "Form to configure and save IAX/DVSwitch gateway connection details, then navigate to the PTT page. Supports optional username, password, port, and node number.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with loading state handling and automatic re-authentication fallback. Clears cached queries on logout.",
  "frontend/src/components/NowHearingList.tsx": "Shows recent transmissions or placeholders when empty or loading. Each entry displays callsign, network, talkgroup, and timestamp.",
  "frontend/src/components/PersonalDirectoryEntries.tsx": "Manages locally stored custom directory entries with add, list, and delete capabilities. Persists entries in localStorage.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Always-open dialog prompting the user to submit callsign, name, and license acknowledgement. Validates input and saves the profile via backend mutation.",
  "frontend/src/components/PttControl.tsx": "Push‑to‑talk button handling press/hold interactions and transmit state visuals. Calls optional callbacks on transmit start and stop and supports disabled state.",
  "frontend/src/components/RealTimeStatusBadge.tsx": "Shows connection, transmit, and receive status badges along with the room label.",
  "frontend/src/components/TransmitDisclaimer.tsx": "Displays a warning alert requiring users to acknowledge a valid amateur radio license before using voice features.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAudioLevelMeter.ts": "Tracks live microphone audio levels using Web Audio API and reports activity state.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches and updates the caller's user profile via backend actor methods.",
  "frontend/src/hooks/useFavorites.ts": "Retrieves and toggles the user's favorite networks using backend calls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication, login state, and persistent identity management.",
  "frontend/src/hooks/useMicPttRecorder.ts": "Handles PTT-style microphone recording with error handling and blob output.",
  "frontend/src/hooks/useNetworks.ts": "Fetches builtin networks and performs client‑side search filtering.",
  "frontend/src/hooks/useNowHearing.ts": "Queries and updates the current list of active transmissions with periodic polling.",
  "frontend/src/hooks/usePreferredConnection.ts": "Saves, loads, and identifies persisted connection configurations including legacy and IAX/DVSwitch formats.",
  "frontend/src/hooks/useQrzLookup.ts": "Runs QRZ callsign lookups through the backend when supported.",
  "frontend/src/hooks/useUserRole.ts": "Fetches the caller's user role and admin status from the backend.",
  "frontend/src/hooks/useWebRtcPtt.ts": "React hook managing WebRTC push-to-talk state, peer connection setup, signaling, audio tracks, and cleanup for a given room.",
  "frontend/src/index.css": "Tailwind base/theme definitions using OKLCH colors and custom utilities for a radio-inspired dark UI.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AboutCompliancePage.tsx": "Page explaining what PTTStar is and outlining licensing, DMR ID requirements, and compliance notices.",
  "frontend/src/pages/ActivityPage.tsx": "Displays live transmission activity with auto-updating feed and manual refresh.",
  "frontend/src/pages/ConnectPage.tsx": "UI for configuring or clearing IAX/DVSwitch connection settings using tabs.",
  "frontend/src/pages/DirectoryPage.tsx": "Provides network browsing and personal directory entry management via tabbed interface.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with app intro, login or connect actions, and feature highlights.",
  "frontend/src/pages/PttPage.tsx": "Push-to-talk page that loads the preferred connection, joins a WebRTC room, manages transmit/receive state, handles mic recording fallback, and displays connection or permission errors.",
  "frontend/src/pages/SettingsPage.tsx": "User settings page allowing callsign, name, and license acknowledgment updates with QRZ lookup integration and profile save/validation handling.",
  "frontend/src/utils/roomKey.ts": "Utilities that derive a stable room key and human-readable label from the current connection type and settings.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and cleaning parameters from hash-based routes.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "No summary available."
}