{
  "backend/main.mo": "Motoko backend defining radio/network types, user profiles, signaling messages, and profile access functions with authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping two navigation‑related fixes to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of short descriptions summarizing major frontend components and pages and their recent behavior updates.",
  "frontend/docs/promotions/version-23-preview-to-production.md": "Promotion record template for Version 23 detailing preview verification steps and emphasizing no‑change deployment rules.",
  "frontend/docs/promotions/version-30-preview-to-production.md": "Draft promotion record for Version 30 outlining required verification checklists and an attestation of no code or config changes.",
  "frontend/docs/publish-preview-to-production.md": "Runbook describing the process and verification requirements for promoting a preview build to production without modifications.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, applying base background and border styles.",
  "frontend/index.html": "HTML entry point that sets PWA metadata and loads the main React bundle.",
  "frontend/public/manifest.webmanifest": "PWA manifest configuring app name, icons, colors, and startup behavior.",
  "frontend/public/offline.html": "Standalone offline fallback page with simple styling and retry button.",
  "frontend/public/sw.js": "Service worker handling caching, offline fallback, and cache cleanup using a network-first strategy.",
  "frontend/src/App.tsx": "Main app router setup with authentication-gated routes and a post-login redirect component.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that displays error details and provides reset and session-clear actions.",
  "frontend/src/components/AppLayout.tsx": "Top-level layout with header, navigation, footer, and auth-aware nav item visibility.",
  "frontend/src/components/AudioLevelMeter.tsx": "Audio input level meter component rendering segmented visual levels based on microphone activity.",
  "frontend/src/components/AuthenticatedFlowFallback.tsx": "Error fallback component for authenticated flows, showing details and offering retry or session reset actions.",
  "frontend/src/components/AuthGate.tsx": "Authentication wrapper that manages Internet Identity login, actor initialization, errors, and session clearing before rendering protected content.",
  "frontend/src/components/ColorAccentPanel.tsx": "Simple styled panel wrapper with neutral theming for grouping UI content.",
  "frontend/src/components/ColorPageHeader.tsx": "Generic page header component displaying title, optional subtitle, and icon with neutral styling.",
  "frontend/src/components/DigitalVoiceConnectForm.tsx": "Form for configuring Digital Voice connections, loading saved settings, applying presets, and validating fields across multiple modes.",
  "frontend/src/components/DigitalVoiceSavedConfigurationTab.tsx": "Displays the saved Digital Voice configuration, highlights missing fields, and shows gateway readiness status with edit options.",
  "frontend/src/components/DirectoryBrowser.tsx": "Directory browser for networks and talkgroups with filtering, search, mode selection, and favorites management.",
  "frontend/src/components/IaxDvswitchConnectForm.tsx": "Form for configuring IAX/DVSwitch or AllStar connections, supporting presets, validation, and saving connection settings.",
  "frontend/src/components/IaxDvswitchSavedConfigurationTab.tsx": "Displays saved IAX/DVSwitch connection details or a warning if none exist, allowing masked password display and optional editing.",
  "frontend/src/components/InstallAppAction.tsx": "Shows a PWA install button with iOS-specific instructions and triggers installation when allowed.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity login/logout flow with error handling, retry, and session clearing.",
  "frontend/src/components/NowHearingList.tsx": "Renders a list of recent radio transmissions with metadata or shows loading/empty states.",
  "frontend/src/components/PersonalDirectoryEntries.tsx": "Manages locally stored personal network directory entries with add and delete functionality.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts new users to enter callsign, name, and license acknowledgement before saving their profile.",
  "frontend/src/components/PttControl.tsx": "Implements a push‑to‑talk button with press/hold detection and transmit state callbacks.",
  "frontend/src/components/RealTimeStatusBadge.tsx": "Displays a status badge showing connection, transmission, or reception state with corresponding icon and styling.",
  "frontend/src/components/TransmitDisclaimer.tsx": "Renders a warning alert requiring users to acknowledge they have a valid radio license, linking to settings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useActorWithError.ts": "Like useActor but with enhanced logging, retry logic, and controlled invalidation to handle initialization errors.",
  "frontend/src/hooks/useAudioLevelMeter.ts": "Tracks microphone audio level in real time using an analyser node, providing level and activation state.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches and saves the current user profile through the actor with retry and query invalidation.",
  "frontend/src/hooks/useFavorites.ts": "Retrieves and toggles favorite networks using actor calls with query invalidation and retry logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, state management, and AuthClient initialization through a React context.",
  "frontend/src/hooks/useMicPttRecorder.ts": "Handles push‑to‑talk microphone recording using MediaRecorder, returning recording state, errors, and callbacks.",
  "frontend/src/hooks/useNetworks.ts": "Fetches builtin networks and provides simple client-side search filtering via actor queries.",
  "frontend/src/hooks/useNowHearing.ts": "Provides hooks to fetch and update real-time \"now hearing\" transmission data using react-query.",
  "frontend/src/hooks/usePreferredConnection.ts": "Defines connection types and helpers for storing, identifying, and validating preferred network connections.",
  "frontend/src/hooks/usePwaInstall.ts": "Handles PWA install prompts, installability detection, and user-triggered installation flow.",
  "frontend/src/hooks/useQrzLookup.ts": "Provides a mutation hook to perform QRZ callsign lookups through the backend actor.",
  "frontend/src/hooks/useRememberLoginPreference.ts": "Manages a persisted user preference for remembering login state across sessions.",
  "frontend/src/hooks/useUserRole.ts": "Fetches the caller's user role and admin status using react-query and the backend actor.",
  "frontend/src/hooks/useWebRtcPtt.ts": "Implements WebRTC push-to-talk logic including room joining, signaling, media handling, and gateway support.",
  "frontend/src/index.css": "Defines Tailwind-based global styles and a custom dark theme using OKLCH color variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AboutCompliancePage.tsx": "Renders the About/Compliance page describing PTTStar, licensing requirements, and creator information.",
  "frontend/src/pages/ActivityPage.tsx": "Displays live activity transmissions with auto-refresh and a NowHearing list inside a styled panel.",
  "frontend/src/pages/ConnectPage.tsx": "Handles connection setup, saved configurations, quick presets, and switching between IAX and Digital Voice connection forms.",
  "frontend/src/pages/DirectoryPage.tsx": "Provides network and talkgroup browsing, personal entries management, and navigation to PTT after selecting a connection.",
  "frontend/src/pages/LandingPage.tsx": "Landing and onboarding page explaining PTTStar requirements and guiding users to core app features.",
  "frontend/src/pages/PttPage.tsx": "Manages WebRTC PTT sessions, room joining, transmit controls, and validation for digital voice and BrandMeister connections.",
  "frontend/src/pages/SettingsPage.tsx": "User profile management page supporting editing callsign and identifiers, license acknowledgement, and login preferences.",
  "frontend/src/utils/digitalVoiceGatewayClient.ts": "WebRTC signaling client that connects to a Digital Voice gateway via WebSocket, sending join metadata and handling SDP/ICE messages.",
  "frontend/src/utils/roomKey.ts": "Generates normalized room keys and labels based on various connection types, reflectors, talkgroups, and metadata.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and cleaning sensitive params from hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, keyframes, and enabled plugins.",
  "project_state.json": "Stores project metadata, issues, and feature requests related to fixing a post-login navigation crash."
}