{
  "backend/main.mo": "Defines authorization mixins, radio/network/transmission types, persistent user and network storage, and query/update methods for profiles and signaling state.",
  "feature_evidence.json": "Lists feature evidence records linking feature requirements to corresponding frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides one‑sentence summaries for numerous frontend components and pages describing their roles and recent behavior updates.",
  "frontend/docs/promotions/version-23-preview-to-production.md": "Deployment-only promotion record for Version 23 with detailed pre‑promotion verification checklists.",
  "frontend/docs/promotions/version-30-preview-to-production.md": "Deployment-only promotion record for Version 30 including change attestation and an expanded verification checklist.",
  "frontend/docs/publish-preview-to-production.md": "Runbook detailing verification steps and requirements for promoting a preview deployment to production without code changes.",
  "frontend/index.css": "Tailwind-based global styles defining color variables and theming for light and dark modes.",
  "frontend/index.html": "Base HTML document loading the PTTStar app root, manifest, and main entry script.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, display settings, and categories.",
  "frontend/public/offline.html": "Standalone offline fallback page with simple styling and a retry button.",
  "frontend/public/sw.js": "Service worker handling install, cache management, and network-first fetch with offline fallbacks.",
  "frontend/src/App.tsx": "Main app setup including routing, authentication handling, and profile setup gating.",
  "frontend/src/components/AppLayout.tsx": "App layout component providing header, navigation, and footer structure with auth-aware menus.",
  "frontend/src/components/AudioLevelMeter.tsx": "Component displaying an audio input level meter with segmented visual feedback.",
  "frontend/src/components/AuthGate.tsx": "Wraps children and prompts the user to log in with Internet Identity if no identity is present.",
  "frontend/src/components/ColorAccentPanel.tsx": "Provides a simple bordered container with optional variant styling for layout grouping.",
  "frontend/src/components/ColorPageHeader.tsx": "Renders a page header with title, optional subtitle, and optional icon using neutral dark styling.",
  "frontend/src/components/DigitalVoiceConnectForm.tsx": "Form for configuring Digital Voice connections, handling presets, validation, state loading, and saving.",
  "frontend/src/components/DigitalVoiceSavedConfigurationTab.tsx": "Displays saved Digital Voice configuration details, gateway status, and provides edit guidance.",
  "frontend/src/components/DirectoryBrowser.tsx": "Allows browsing, filtering, and selecting networks and talkgroups with support for favorites and search.",
  "frontend/src/components/IaxDvswitchConnectForm.tsx": "Form for creating or editing IAX/DVSwitch connections, including presets, validation, and saving.",
  "frontend/src/components/IaxDvswitchSavedConfigurationTab.tsx": "Shows stored IAX/DVSwitch settings with options to edit or proceed to PTT.",
  "frontend/src/components/InstallAppAction.tsx": "Provides an install button and iOS-specific instructions for installing the PWA, showing dialogs and handling install prompts.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity login/logout flow with status handling and query cache clearing.",
  "frontend/src/components/NowHearingList.tsx": "Displays recent transmissions with metadata, showing loading and empty states when needed.",
  "frontend/src/components/PersonalDirectoryEntries.tsx": "Manages locally stored personal network entries with add, delete, and form controls.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Shows a required setup dialog for entering callsign and profile data with validation and save logic.",
  "frontend/src/components/PttControl.tsx": "Implements a push‑to‑talk button handling press interactions and transmit state visuals.",
  "frontend/src/components/RealTimeStatusBadge.tsx": "Shows real-time connection, transmit, and receive status with dynamic icons and styling.",
  "frontend/src/components/TransmitDisclaimer.tsx": "Displays a warning requiring license acknowledgement before voice features, linking to settings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAudioLevelMeter.ts": "Tracks microphone audio levels using Web Audio API and returns normalized level and active state.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches and updates the caller's user profile via react-query and actor API.",
  "frontend/src/hooks/useFavorites.ts": "Retrieves and toggles favorite networks using react-query and the actor backend.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities and handling login/logout with AuthClient.",
  "frontend/src/hooks/useMicPttRecorder.ts": "Handles push‑to‑talk microphone recording with MediaRecorder and returns the final audio blob URL.",
  "frontend/src/hooks/useNetworks.ts": "Fetches builtin networks and performs client-side search filtering via react-query.",
  "frontend/src/hooks/useNowHearing.ts": "Retrieves and updates real-time transmission data, polling periodically via react-query.",
  "frontend/src/hooks/usePreferredConnection.ts": "Defines connection types and helpers for saving/loading preferred network connections with backward compatibility.",
  "frontend/src/hooks/usePwaInstall.ts": "Detects PWA installability, manages install prompts, and identifies iOS and installed states.",
  "frontend/src/hooks/useQrzLookup.ts": "Runs a QRZ callsign lookup through the actor backend if supported.",
  "frontend/src/hooks/useRememberLoginPreference.ts": "Stores and retrieves the user's 'remember login' preference using localStorage.",
  "frontend/src/hooks/useUserRole.ts": "Fetches the caller's user role and admin status from the backend via react-query.",
  "frontend/src/hooks/useWebRtcPtt.ts": "Implements a WebRTC push-to-talk hook managing peer connections, media streams, gateway signaling, and transmission state.",
  "frontend/src/index.css": "Defines Tailwind-based global styles, dark theme variables, and utility classes for status lights and accents.",
  "frontend/src/main.tsx": "Bootstraps the React app, providing React Query and Internet Identity context before rendering App.",
  "frontend/src/pages/AboutCompliancePage.tsx": "Renders an about page describing PTTStar, licensing requirements, and digital voice ID guidance.",
  "frontend/src/pages/ActivityPage.tsx": "Displays a live-updating list of recent transmissions with manual refresh and activity metadata.",
  "frontend/src/pages/ConnectPage.tsx": "Provides UI for configuring, saving, and managing IAX/DVSwitch or digital voice connections with quick-setup options.",
  "frontend/src/pages/DirectoryPage.tsx": "Allows browsing networks and talkgroups, managing personal entries, and saving directory-based connections for PTT use.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component showing app intro, requirements, and getting-started info for PTTStar.",
  "frontend/src/pages/PttPage.tsx": "Push-to-talk page managing connection state, room joining, transmit controls, and real-time activity display.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page allowing users to edit profile, DMR info, preferences, and manage Internet Identity login.",
  "frontend/src/utils/digitalVoiceGatewayClient.ts": "WebRTC signaling client for Digital Voice gateways handling WebSocket connection, SDP exchange, and ICE messages.",
  "frontend/src/utils/roomKey.ts": "Utility for generating stable room keys and human-readable labels from IAX, Digital Voice, or directory connections.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hashes, and session storage.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing feature requirements and pending requests for simplified BrandMeister and AllStar connection setup."
}