{
  "kind": "build_request",
  "title": "Promote current preview deployment to live Internet Computer URL (production)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Promote the currently deployed preview build (reported as Version 55) to the live/production Internet Computer URL following the existing preview-to-production runbook, without introducing any code or configuration changes.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes proceed"
        ]
      },
      "acceptanceCriteria": [
        "Promotion is executed as a deployment-only operation (no application code changes, no configuration changes).",
        "The production/live frontend canister serves the app successfully at the default IC URL.",
        "The production/live deployment uses the same build artifacts as the current preview build (Version 55)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Complete pre-publish verification for the preview build and document the results in a version-specific promotion record markdown file under `frontend/docs/promotions/` (create `frontend/docs/promotions/version-55-preview-to-production.md` if it does not exist), including PASS/PASS WITH NOTES/FAIL outcomes, notes, issue classification, and the required attestation that no code/config changes were made.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes proceed"
        ]
      },
      "acceptanceCriteria": [
        "A promotion record exists for Version 55 under `frontend/docs/promotions/` and includes completed checklist sections for the key flows listed in `frontend/docs/publish-preview-to-production.md`.",
        "The promotion record contains explicit attestation statements that application code changes = NONE and configuration changes = NONE.",
        "The promotion record includes an overall status and a recommendation (PROCEED WITH PROMOTION / DO NOT PROMOTE)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "After promotion, provide the new live Internet Computer access details by recording the production frontend canister URL and the backend canister ID in a deployment record under `frontend/docs/deployments/` (create a Version 55 production deployment record if needed) and ensure the live links are discoverable from the documentation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes proceed"
        ]
      },
      "acceptanceCriteria": [
        "A production deployment record for Version 55 exists under `frontend/docs/deployments/` and includes: frontend canister ID, default IC URL, and backend canister ID.",
        "The documented production URL loads the app and the frontend can reach the backend canister without showing a backend connectivity error under normal conditions."
      ]
    }
  ],
  "constraints": [
    "Follow `frontend/docs/publish-preview-to-production.md` runbook for the promotion process.",
    "Do not introduce any application code changes during promotion.",
    "Do not introduce any configuration changes during promotion."
  ],
  "nonGoals": [
    "Generate or provide an Android APK build (not supported in this platform flow).",
    "Add new app features as part of the promotion."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}