{
  "kind": "build_request",
  "title": "Redesign IAX/DVSwitch settings to match DVSwitch layout with codec selection and phone-to-IAX confirmation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the IAX / DVSwitch configuration form UI to use a DVSwitch-style field order and labeling: Hostname, Port, Username, Password, Callsign, Node Number.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want the IAX field to look like the DV switch IAX field have a host name then pork then username then password then call sign then no number"
        ]
      },
      "acceptanceCriteria": [
        "In the IAX / DVSwitch Configure UI, the primary inputs are shown in this order: Hostname, Port, Username, Password, Callsign, Node Number.",
        "User-facing labels are in English and use consistent capitalization: \"Hostname\", \"Port\", \"Username\", \"Password\", \"Callsign\", \"Node Number\".",
        "Existing behaviors still work: saved IAX connection values are loaded into the form on mount, and Save persists the updated values."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a \"Phone to IAX connection\" checkbox to the IAX / DVSwitch configuration and require it to be checked before allowing the user to save the IAX / DVSwitch configuration.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "have phone to IAX connection as a checkbox to confirm that's what they're using"
        ]
      },
      "acceptanceCriteria": [
        "The IAX / DVSwitch Configure UI includes a checkbox labeled \"Phone to IAX connection\".",
        "When the checkbox is unchecked, the Save action is blocked and the UI shows an English validation message explaining that confirmation is required.",
        "When the checkbox is checked, Save works normally and the value is persisted with the saved IAX / DVSwitch connection settings."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a \"Codec Types\" selection control to the IAX / DVSwitch configuration (presented as a tab or clearly labeled segmented option) with allowed values: ulaw, slin, adpcm, and persist the selected codec with the saved IAX / DVSwitch connection.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "put a Codac Types tab for server selection which can be ulaw , slin , adpcm"
        ]
      },
      "acceptanceCriteria": [
        "The IAX / DVSwitch Configure UI includes a codec selector labeled \"Codec Types\" with options \"ulaw\", \"slin\", and \"adpcm\".",
        "A codec is always selected (use a sensible default if none is saved).",
        "The selected codec is stored alongside the other IAX / DVSwitch connection settings and is restored when revisiting the Configure UI.",
        "The Saved IAX / DVSwitch Configuration view shows the selected codec type in a readable way."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Extend the IAX / DVSwitch saved-configuration display to include the new \"Phone to IAX connection\" state and the selected codec type, while continuing to mask passwords.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "have phone to IAX connection as a checkbox... and put a Codac Types tab..."
        ]
      },
      "acceptanceCriteria": [
        "The Saved IAX / DVSwitch Configuration card shows \"Phone to IAX connection\" as Yes/No (or Enabled/Disabled) based on the saved setting.",
        "The Saved IAX / DVSwitch Configuration card shows \"Codec Types\" with the saved value (ulaw/slin/adpcm).",
        "Passwords remain masked as they are today."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update the connection settings storage/types used by the frontend so the IAX / DVSwitch connection can persist (a) phone-to-IAX confirmation and (b) codec type without breaking existing saved sessions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add a username for the IAX file as well",
          "have phone to IAX connection as a checkbox",
          "Codac Types tab... ulaw , slin , adpcm"
        ]
      },
      "acceptanceCriteria": [
        "The IAX / DVSwitch connection type includes new optional fields for phone-to-IAX confirmation and codec type, and the app continues to load older saved IAX configurations without runtime errors.",
        "Room key/label derivation and PTT navigation continue to work for IAX / DVSwitch connections after the type change.",
        "No changes are required from users who already have an IAX / DVSwitch configuration saved; the app selects defaults for newly introduced fields if missing."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or other frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Keep backend as a single Motoko actor; only introduce backend changes if strictly necessary for these UI/settings changes.",
    "Use English for all user-facing text and validation messages."
  ],
  "nonGoals": [
    "Implementing or modifying actual IAX audio transmission/codec negotiation behavior (this request is limited to configuration UI and persisted settings).",
    "Adding third-party authentication methods beyond Internet Identity.",
    "Adding real-time networking protocols beyond what the app already uses."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}