{
  "kind": "build_request",
  "title": "Fix post-login navigate null crash",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-3",
      "text": "Fix the crash \"Cannot read properties of null (reading 'navigate')\" by ensuring any code that calls TanStack Router navigation hooks (e.g., `useNavigate`) is rendered within the Router context and cannot execute before the router is mounted.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "It says \"Cannot read properties of null (reading 'navigate')",
          "Fix the navigate null crash"
        ]
      },
      "acceptanceCriteria": [
        "Logging in with Internet Identity does not crash the app with a navigate/null error.",
        "`FirstSignInGuide` (or its replacement) is rendered within the RouterProvider tree (i.e., within a routed component such as the root layout / route components), not as a sibling of `<RouterProvider />`.",
        "Any post-login redirect logic runs only after router context is available and auth/profile loading prerequisites are satisfied."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a defensive guard around the post-login redirect logic so navigation is skipped when prerequisites are not met (e.g., auth still initializing, profile not fetched, or a redirect already occurred), preventing repeated redirects and avoiding calling navigation during transient states.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Most likely: after fixing the Internet Identity crash, the post‑login screen is navigating too early or from a component not wrapped in the router."
        ]
      },
      "acceptanceCriteria": [
        "Post-login redirect triggers at most once per session for an eligible user (authenticated, profile exists, no saved connection).",
        "If the user is not authenticated or profile is not ready, no navigation attempt is made and no error is thrown.",
        "Manual navigation across pages (e.g., /connect, /ptt, /settings) works normally after login, with no regression in route rendering."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only).",
    "Do not modify immutable hook files (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, and related immutable paths listed in SYSTEM_CONTEXT)."
  ],
  "nonGoals": [
    "Do not redesign the login flow UI beyond what is required to prevent the crash.",
    "Do not change backend canister logic or data schemas; this fix should be achievable purely in the frontend routing/layout structure."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}