{
  "kind": "build_request",
  "title": "Fix app background so pages render with a dark/black background instead of white",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-45",
      "text": "Ensure the global application background renders as dark (not white) by applying the dark theme background token to the document (html/body) so that areas outside routed content and any uncovered viewport regions are not white.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "No nothing has changed It's still white is not black or dark background It's a white background change the white background to a dark background"
        ]
      },
      "acceptanceCriteria": [
        "On initial load (including before authentication), the visible page background is dark/black rather than white.",
        "There is no white background visible around the app (e.g., page margins, overscroll area, or any region not covered by the routed page content).",
        "The change is implemented via global styling (e.g., in frontend/src/index.css) using existing Tailwind tokens/classes (e.g., bg-background) so it remains consistent across all routes."
      ]
    },
    {
      "id": "REQ-46",
      "text": "Verify and adjust the layout/background stacking so the dark background consistently covers the full viewport height across all screens, including when content is short and when the mobile bottom navigation is present.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "It's still white is not black or dark background"
        ]
      },
      "acceptanceCriteria": [
        "Landing, Connect, PTT, Activity, Settings, and About pages all show a consistent dark background even when the page content is shorter than the viewport height.",
        "No white strip appears behind/around the fixed mobile bottom navigation or at the bottom of the page when scrolling.",
        "The app’s existing card/panel styling remains readable and unchanged except where strictly necessary to prevent white background bleed-through."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Keep the backend unchanged; this is a styling/layout fix only."
  ],
  "nonGoals": [
    "Do not redesign the UI or change page content/features.",
    "Do not introduce new authentication, routing, or backend data model changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}