{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Production publish documentation + frontend recovery for Unauthorized profile load traps",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add robust frontend recovery UI when profile load fails with Unauthorized so the app never remains stuck on “Connecting to backend”.",
      "acceptanceCriteria": [
        "If the backend returns an Unauthorized trap during current user profile fetch, the app shows an error state with actionable options (Retry and Clear Session at minimum).",
        "Retry re-attempts the failed query; Clear Session clears client session storage and React Query cache, then returns the user to a state where they can log in again.",
        "No changes are made to immutable frontend paths listed in SYSTEM_CONTEXT."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/authErrors.ts",
          "operation": "create",
          "description": "Add small shared helpers to identify authorization-related backend trap messages (e.g., matching “Unauthorized: …”) so UI can present tailored recovery messaging. Use guidance from the selected “authorization” component for handling authorization errors gracefully; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useCurrentUserProfile.ts",
          "operation": "modify",
          "description": "Adjust current-user profile fetch behavior to surface Unauthorized traps promptly and predictably (e.g., avoid repeated retries on Unauthorized), ensuring the error state is reachable and not masked by loading/retry loops. Use the selected “authorization” component guidance for profile setup/loading patterns and auth cache clearing expectations; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AuthenticatedFlowFallback.tsx",
          "operation": "modify",
          "description": "Enhance the authenticated-flow fallback card to present clearer, authorization-specific recovery text when the error is Unauthorized, while retaining actionable controls (Retry + Clear Session). Use the selected “authorization” component guidance for AccessDenied / unauthorized UX; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update RootLayout authenticated initialization handling so profile-load Unauthorized errors reliably switch from the interstitial/“Connecting” state to the fallback error UI (with Retry and Clear Session wired), and Retry re-attempts actor + profile queries. Use the selected “authorization” component guidance for logout/cache clearing and post-login profile fetch flow; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/PostLoginInterstitial.tsx",
          "operation": "modify",
          "description": "Refine the interstitial timeout copy and behavior to explicitly guide users to Retry/Clear Session when post-login profile load is taking too long, reducing the likelihood of the UI appearing stuck. Use the selected “authorization” component guidance for login/logout cache clearing expectations; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/clearClientSession.ts",
          "operation": "modify",
          "description": "Confirm Clear Session fully resets client state required for recovery: localStorage auth keys, sessionStorage, and any other app-scoped persisted state used in authenticated flows, aligning with the app’s React Query cache clear behavior. Use the selected “authorization” component guidance for clearing cached application data on logout; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Document promotion of the verified preview build to production using the existing runbook, including new/updated promotion and deployment records for the new production version.",
      "acceptanceCriteria": [
        "A new (or updated) version-specific promotion record exists under frontend/docs/promotions/ documenting the full pre-publish verification checklist with PASS / PASS WITH NOTES / FAIL entries, issue classification, and an explicit attestation of no code/config changes during the promotion step.",
        "A corresponding production deployment record exists under frontend/docs/deployments/ for the new production version, with the required access/verification notes consistent with prior deployment records.",
        "Production deployment is reachable by the frontend without \"Unable to connect to backend services\" errors under normal conditions.",
        "Post-publish, the Authentication & Authorization checklist item \"User profile loads correctly after login\" passes in production."
      ],
      "file_operations": [
        {
          "path": "frontend/docs/promotions/version-56-preview-to-production.md",
          "operation": "create",
          "description": "Create the version-specific promotion record for the new production version (Version 56) by following frontend/docs/publish-preview-to-production.md, completing every checklist section with PASS / PASS WITH NOTES / FAIL, issue classification, and explicit attestation of no code/config changes during promotion."
        },
        {
          "path": "frontend/docs/deployments/version-56-production-deployment.md",
          "operation": "create",
          "description": "Create the corresponding production deployment record for Version 56 consistent with prior deployment records, including production access/verification notes and post-deploy checks (including “User profile loads correctly after login”)."
        },
        {
          "path": "frontend/docs/promotions/README.md",
          "operation": "modify",
          "description": "Update the promotions index to reflect Version 56 as the current production version and add the new promotion/deployment links in the history."
        },
        {
          "path": "frontend/docs/deployments/README.md",
          "operation": "modify",
          "description": "Update the deployments index to reflect Version 56 as the current production deployment and link to the new Version 56 deployment record (and associated promotion record)."
        }
      ]
    }
  ]
}