{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Ensure global dark background renders correctly via OKLCH token fixes and CSS fallbacks",
  "requirements": [
    {
      "id": "REQ-47",
      "summary": "Fix global theme CSS variables so Tailwind `oklch(var(--...))` utilities evaluate to valid dark colors (no nested `oklch(oklch(...))`).",
      "acceptanceCriteria": [
        "`--background`, `--foreground`, and other theme tokens in `frontend/src/index.css` are formatted so that Tailwind’s `oklch(var(--...))` color definitions evaluate correctly (no nested `oklch(oklch(...))`).",
        "The computed CSS value of an element using `bg-background` is a dark/black color in the browser devtools (not transparent/invalid).",
        "All main screens (Landing, Connect, PTT, Activity, Settings, About) render with a dark/black app background without requiring the user to toggle a theme switch."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update `:root` theme tokens (e.g., `--background`, `--foreground`, `--card`, etc.) to store raw OKLCH components like `0.15 0.01 240` instead of `oklch(...)` strings so Tailwind color utilities defined as `oklch(var(--token))` resolve correctly."
        }
      ]
    },
    {
      "id": "REQ-48",
      "summary": "Add an explicit dark global background fallback on `html`, `body`, and `#root` so the app never renders white even if CSS variables fail.",
      "acceptanceCriteria": [
        "With CSS variables temporarily removed/overridden in devtools, the page background still remains dark due to the explicit fallback background color.",
        "The dark/black background covers the full viewport height on short pages and on mobile with the bottom navigation present (no white bands at the top/bottom)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "In base styles for `html`, `body`, and `#root`, add a non-variable fallback `background-color` set to a dark/black color (e.g., a direct `oklch(...)` literal or hex) in addition to existing Tailwind `@apply bg-background`, and ensure height/min-height rules prevent any uncovered viewport areas."
        }
      ]
    },
    {
      "id": "REQ-49",
      "summary": "Remove/reconcile conflicting global CSS that can override dark theme tokens and reintroduce a light background at runtime.",
      "acceptanceCriteria": [
        "Only one active set of global theme tokens is applied at runtime for `--background`/`--foreground` (verified in devtools computed styles), and those tokens produce a dark/black background.",
        "A hard refresh still results in a black/dark background; the issue does not reappear due to cached or competing CSS."
      ],
      "file_operations": [
        {
          "path": "frontend/index.css",
          "operation": "delete",
          "description": "Remove the extra global stylesheet that defines a competing light `:root` token set (and a `.dark` override) to ensure only `frontend/src/index.css` provides the runtime theme tokens and no light overrides can be introduced by accidental inclusion."
        }
      ]
    }
  ]
}