{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix TanStack Router navigate null crash after login",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Ensure post-login navigation logic only runs inside TanStack Router context (RouterProvider tree) to prevent navigate/null crash.",
      "acceptanceCriteria": [
        "Logging in with Internet Identity does not crash the app with a navigate/null error.",
        "`FirstSignInGuide` (or its replacement) is rendered within the RouterProvider tree (i.e., within a routed component such as the root layout / route components), not as a sibling of `<RouterProvider />`.",
        "Any post-login redirect logic runs only after router context is available and auth/profile loading prerequisites are satisfied."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Move `FirstSignInGuide` (or replace it with a routed `PostLoginRedirector` component) so it is rendered from within the root route component tree (e.g., inside `RootLayout` alongside `<Outlet />`) rather than as a sibling of `<RouterProvider />`. This ensures `useNavigate` is always called under router context and cannot execute before the router is mounted."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add defensive guards to post-login redirect so it runs at most once and only when auth/profile prerequisites are ready.",
      "acceptanceCriteria": [
        "Post-login redirect triggers at most once per session for an eligible user (authenticated, profile exists, no saved connection).",
        "If the user is not authenticated or profile is not ready, no navigation attempt is made and no error is thrown.",
        "Manual navigation across pages (e.g., /connect, /ptt, /settings) works normally after login, with no regression in route rendering."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Harden the redirect effect: gate navigation on (1) router availability (now guaranteed by rendering within `RootLayout`), (2) `isInitializing === false`, (3) profile query readiness (`!profileLoading && isFetched`), and (4) eligibility checks (`identity` present, `userProfile !== null`, and `loadConnection() === null`). Add an additional 'redirect already occurred' guard that persists for the browser session (e.g., `sessionStorage` keyed by principal) to prevent repeated redirects across route transitions/rerenders, and avoid redirecting when already on `/connect` to prevent loops."
        }
      ]
    }
  ]
}