{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Credentials-only quick setup for BrandMeister and AllStar (auto-select servers, hide URLs)",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "BrandMeister DMR quick setup auto-selects a built-in master (prefer US) and hides manual server entry behind Advanced.",
      "acceptanceCriteria": [
        "On the Connect page, choosing BrandMeister DMR quick setup results in a saved Digital Voice configuration that includes a non-empty bmServerAddress without the user typing any URL/hostname.",
        "The default selected BrandMeister server is the built-in \"BrandMeister United States\" entry when available.",
        "Any UI control that allows freeform BrandMeister server URL/hostname entry is not shown in the default/basic view (only allowed in an Advanced section if kept)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DigitalVoiceConnectForm.tsx",
          "operation": "modify",
          "description": "Adjust the BrandMeister (DMR) preset UX to be credentials-only by default: ensure the preset auto-selects a BrandMeister server (preferring the built-in \"BrandMeister United States\" when present) and persists bmServerAddress without any user-entered hostname; move the BrandMeister server selection control into the existing Advanced section (show only a non-editable summary in the basic view). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "AllStar quick setup auto-sets gateway/server (default allstarlink.org or directory entry) and hides freeform gateway entry behind Advanced.",
      "acceptanceCriteria": [
        "On the Connect page, choosing AllStar Network quick setup pre-fills gateway/server with \"allstarlink.org\" (or selects an AllStarLink directory entry if one exists) without requiring the user to type any URL/hostname.",
        "Saving an IAX/DVSwitch configuration does not require typing any gateway/server URL/hostname in the default/basic view.",
        "Any UI control that allows freeform gateway/server URL/hostname entry is not shown in the default/basic view (only allowed in an Advanced section if kept)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/IaxDvswitchConnectForm.tsx",
          "operation": "modify",
          "description": "Update the AllStar preset flow to set the gateway/server automatically (prefer an AllStarLink directory entry when available; otherwise default to \"allstarlink.org\") and remove the need for users to type/paste a gateway/server in the basic view by moving the freeform gateway input into a new/expanded Advanced section (or removing it from basic view). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "After entering required non-URL credential fields for BrandMeister or AllStar presets, auto-save the configuration and navigate to /ptt.",
      "acceptanceCriteria": [
        "For BrandMeister preset: after the user enters BrandMeister username + hotspot security password (and any other already-required non-URL fields), the app auto-saves the configuration and navigates to /ptt without prompting for any URL/hostname.",
        "For AllStar preset: after the user enters AllStar username/password (and any other already-required non-URL fields such as node number if still required), the app auto-saves the configuration and navigates to /ptt without prompting for any URL/hostname.",
        "No part of the default Connect UI requires the user to supply a URL/hostname to proceed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DigitalVoiceConnectForm.tsx",
          "operation": "modify",
          "description": "Refactor the BrandMeister preset auto-save logic to trigger only after the user has provided required non-URL fields in the basic view (e.g., BrandMeister username + hotspot security password, plus any existing required fields) while keeping any URL/hostname fields out of the default flow; then auto-save and navigate to /ptt. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/IaxDvswitchConnectForm.tsx",
          "operation": "modify",
          "description": "Implement a credentials-only onboarding flow for the AllStar preset: once required non-URL fields (e.g., AllStar username/password and node number if required) are provided, auto-save and navigate to /ptt without requiring any gateway/server hostname entry in the basic view. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/usePreferredConnection.ts",
          "operation": "modify",
          "description": "Align saved-configuration validation helpers with the credentials-only preset flows (BrandMeister and AllStar) so auto-save readiness reflects required non-URL fields while not forcing any user-entered URL/hostname in the default Connect UI. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}