{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-12T22:56:54.085Z",
  "summary": "The diff adds Version 55 promotion/deployment documentation indexes and records, but also includes application code changes (backend and multiple frontend files) and leaves production canister IDs/URLs as placeholders, which conflicts with the deployment-only/no-changes constraint and prevents meeting the documented access-details acceptance criteria.",
  "missing_requirements": [
    {
      "id": "REQ-1",
      "requirement": "Promote the currently deployed preview build (Version 55) to production following the runbook, as a deployment-only operation with no application code or configuration changes, using the same build artifacts as preview.",
      "reason": "The diff shows application code changes (backend and referenced frontend changes), which violates the constraint/AC that the promotion must not introduce any code or configuration changes; the diff also does not provide evidence of using identical preview artifacts beyond documentation assertions.",
      "evidence": [
        "backend/main.mo",
        "frontend-file-summaries.txt",
        "frontend/docs/promotions/version-55-preview-to-production.md",
        "frontend/docs/deployments/version-55-production-deployment.md"
      ]
    },
    {
      "id": "REQ-3",
      "requirement": "Record the production frontend canister URL and backend canister ID for Version 55 in a deployment record and ensure the live links are discoverable from documentation.",
      "reason": "The Version 55 production deployment record contains placeholders instead of actual frontend canister ID, default IC URL, and backend canister ID, so the required access details are not actually provided.",
      "evidence": [
        "frontend/docs/deployments/version-55-production-deployment.md",
        "frontend/docs/deployments/README.md"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Implemented/modified backend application logic during what should be a deployment-only promotion.",
      "reason": "BuildRequest explicitly prohibits application code changes during promotion; however the diff includes modifications to backend code.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "description": "Implemented/modified multiple frontend application features (auth provider changes, UI/flow changes, presets, directory sources, etc.) during what should be a deployment-only promotion.",
      "reason": "BuildRequest explicitly prohibits application code changes and adding new app features as part of the promotion; the diff summary enumerates many frontend feature/code changes.",
      "evidence": [
        "frontend-file-summaries.txt"
      ]
    },
    {
      "description": "Documentation asserts and lists “Key Features” for Version 55 (e.g., Enhanced BrandMeister detection, TGIF DMR support, AllStar preset, improved error handling), implying feature work as part of the promotion.",
      "reason": "Adding new app features is a stated non-goal for the promotion; including feature-forward changes/documentation as part of the promotion is not requested and conflicts with the intended deployment-only scope.",
      "evidence": [
        "frontend/docs/deployments/README.md",
        "frontend/docs/promotions/README.md"
      ]
    }
  ],
  "confidence": 0.78,
  "changed_files": [
    "backend/main.mo",
    "frontend-file-summaries.txt",
    "frontend/docs/deployments/README.md",
    "frontend/docs/deployments/version-55-production-deployment.md",
    "frontend/docs/promotions/README.md",
    "frontend/docs/promotions/version-55-preview-to-production.md",
    "project_state.json"
  ]
}